Merge pull request #1 from piemar/docs-analysis
Updates and fixes for all labs
